export const courseVocabulary = {
  1: 2,
  2: 3,
  3: 4,
  4: 2,
};

export const profileOptions = {
  faculty: [
    { value: 'Факультет біології, географії та екології' },
    { value: 'Факультет бізнесу і права' },
    { value: 'Факультет української й іноземної філології та журналістики' },
    { value: 'Факультет культури й мистецтв' },
    { value: 'Факультет психології, історії та соціології' },
    { value: "Факультет комп'ютерних наук, фізики та математики" },
    { value: 'Факультет фізичного виховання та спорту' },
    { value: 'Педагогічний факультет' },
    { value: 'Медичний факультет' },
  ],
  specialty: [
    { value: '014.04 Середня освіта. Математика' },
    { value: '014.08 Середня освіта. Фізика' },
    { value: '014.09 Середня освіта. Інформатика' },
    { value: '104 Фізика та астрономія' },
    { value: '121 Інженерія програмного забезпечення' },
    { value: "122 Комп'ютерні науки" },
    { value: '126 Інформаційні системи та технології' },
  ],
  grade: [{ value: 'Бакалавр' }, { value: 'Магістр' }, { value: 'Аспірант' }],
  course: [{ value: '1' }, { value: '2' }, { value: '3' }, { value: '4' }],
  form: [
    { value: 'За кошти державного бюджету' },
    { value: 'За кошти фізичної особи' },
  ],
};

export const subjectOptions = [
  {
    title: 'Ділові відносини в бізнесі та управлінні',
    description:
      'Курс знайомить студентів із основними принципами ділової комунікації та ефективного управління в бізнес-середовищі',
    faculty: 'Факультет бізнесу і права',
    teacher: 'Петренко Дмитро Олегович',
    course: 1,
  },
  {
    title: 'Ораторське мистецтво',
    description:
      'Студенти навчаться володіти техніками публічного виступу та впевненим вираженням думок перед аудиторією',
    faculty: 'Факультет культури й мистецтв',
    teacher: 'Шевченко Григорій Петрович',
    course: 1,
  },
  {
    title: 'Перша невідкладна допомога',
    description:
      'Курс охоплює основні навички надання першої допомоги в екстрених ситуаціях',
    faculty: 'Медичний факультет',
    teacher: 'Коваленко Ірина Андріївна',
    course: 1,
  },
  {
    title: 'Правила дорожнього руху',
    description:
      'Студенти дізнаються про основні положення ПДР та практичне їх застосування для безпечного руху',
    faculty: 'Факультет бізнесу і права',
    teacher: 'Сидоренко Володимир Олегович',
    course: 1,
  },
  {
    title: 'Стратегії і тактики впливу та маніпуляцій',
    description:
      'Курс досліджує прийоми впливу на думки і поведінку людей, а також способи протидії маніпуляціям',
    faculty: 'Факультет української й іноземної філології та журналістики',
    teacher: 'Марченко Тетяна Олегівна',
    course: 1,
  },
  {
    title: 'Практичний маркетинг',
    description:
      'Практичний курс з основ маркетингових стратегій, аналізу ринку та розробки рекламних кампаній',
    faculty: 'Факультет бізнесу і права',
    teacher: 'Кравченко Петро Васильович',
    course: 1,
  },
  {
    title: 'Волейбол',
    description:
      'Заняття спрямовані на розвиток фізичної витривалості, командної гри та основних навичок у волейболі',
    faculty: 'Факультет фізичного виховання та спорту',
    teacher: 'Дяченко Наталя Георгіївна',
    course: 1,
  },
  {
    title: 'Основи дієтології',
    description:
      'Курс ознайомлює студентів із принципами збалансованого харчування та методами створення індивідуальних дієт',
    faculty: 'Факультет фізичного виховання та спорту',
    teacher: 'Ященко Діана Максимівна',
    link: 'https://drive.google.com/drive/folders/1REWlLD4uVU7GjJBG-fcqgrx04sf17737?usp=drive_link',
    course: 2,
  },
  {
    title: 'Психологія брехні',
    description:
      'Студенти вивчають психологічні основи обману, розпізнавання брехні та методи аналізу невербальної комунікації',
    faculty: 'Факультет психології, історії та соціології',
    teacher: 'Лисенко Павло Олексійович',
    course: 2,
  },
  {
    title: 'Управлінські інформаційні системи в обліку та оподаткуванні',
    description:
      'Курс присвячений використанню сучасних інформаційних систем для оптимізації управління обліком і оподаткуванням',
    faculty: 'Факультет бізнесу і права',
    teacher: 'Таточенко Іван Миколайович',
    course: 2,
  },
  {
    title: 'Зелена енергетика',
    description:
      'Курс розглядає інноваційні підходи до використання відновлюваних джерел енергії та їх екологічні переваги',
    faculty: 'Факультет біології, географії та екології',
    teacher: 'Мельник Юрій Володимирович',
    course: 2,
  },
  {
    title: 'Оздоровчий фітнес',
    description:
      'Практичний курс для розвитку фізичної активності, поліпшення здоров’я та формування стійких спортивних звичок',
    faculty: 'Медичний факультет',
    teacher: 'Мороз Ганна Ярославівна',
    course: 2,
  },
  {
    title: 'Практика ведення переговорів',
    description:
      'Студенти навчаться ефективним технікам переговорів та аналізу ситуацій для досягнення взаємовигідних рішень',
    faculty: 'Факультет бізнесу і права',
    teacher: 'Романюк Олександр Сергійович',
    course: 2,
  },
  {
    title: 'Підготовка дитини до школи',
    description:
      'Курс орієнтований на вивчення методик розвитку основних навичок дитини для успішного навчання в школі',
    faculty: 'Педагогічний факультет',
    teacher: 'Павленко Олексій Васильович',
    course: 3,
  },
  {
    title: 'Міфологія та релігія давньосхідних цивілізацій',
    description:
      'Курс досліджує ключові міфи, релігійні традиції та їх вплив на культуру і суспільство давнього Сходу',
    faculty: 'Факультет культури й мистецтв',
    teacher: 'Романюк Алла Григорівна',
    course: 3,
  },
  {
    title: 'Стрес та шляхи його подолання',
    description:
      'Студенти вивчають причини виникнення стресу, його вплив на психіку та ефективні техніки управління стресовими станами',
    faculty: 'Факультет психології, історії та соціології',
    teacher: 'Лозова Ілона Володимирівна',
    course: 3,
  },
  {
    title: 'Англійська за кордоном',
    description:
      'Курс розроблений для поглиблення мовних навичок із врахуванням культурних аспектів англомовного середовища',
    faculty: 'Факультет української й іноземної філології та журналістики',
    teacher: 'Руденко Лариса Петрівна',
    course: 3,
  },
  {
    title: 'Сучансі тренди фітнес індустрії',
    description:
      'Курс охоплює актуальні підходи до тренувань, технології у фітнесі та методи створення фітнес-програм',
    faculty: 'Факультет фізичного виховання та спорту',
    teacher: 'Бондаренко Ганна Василівна',
    course: 3,
  },
  {
    title: 'Дропшипінг',
    description:
      'Курс знайомить студентів з основами бізнес-моделі дропшипінгу, включаючи налаштування процесів і стратегії продажів',
    faculty: 'Факультет бізнесу і права',
    teacher: 'Козак Дмитро Іванович',
    course: 3,
  },
  {
    title: 'Економіка бізнесу',
    description:
      'Курс присвячений основам економічного аналізу бізнесу, плануванню витрат і управлінню ресурсами',
    faculty: 'Факультет бізнесу і права',
    teacher: 'Малевич Роман Володимирович',
    course: 3,
  },
  {
    title: 'Інтернет маркетинг',
    description:
      'Курс охоплює стратегії цифрового маркетингу, SEO, SMM і використання реклами в інтернеті для просування продуктів',
    faculty: 'Факультет бізнесу і права',
    teacher: 'Дорошенко Олексій Віталійович',
    course: 3,
  },
  {
    title: 'Бізнес комунікації',
    description:
      'Курс вивчає основи ефективної ділової комунікації, стратегії переговорів та корпоративного спілкування',
    faculty: 'Факультет бізнесу і права',
    teacher: 'Кравченко Світлана Володимирівна',
    course: 4,
  },
  {
    title: 'Польська мова для початківців',
    description:
      'Курс спрямований на освоєння базових граматичних структур, лексики та навичок спілкування польською мовою',
    faculty: 'Факультет української й іноземної філології та журналістики',
    teacher: 'Паламарчук Богдан Сергійович',
    course: 4,
  },
  {
    title: 'Англомовний молодіжний сленг',
    description:
      'Студенти знайомляться з популярними виразами англомовного сленгу та їх контекстом у сучасній культурі',
    faculty: 'Факультет української й іноземної філології та журналістики',
    teacher: 'Біла Анастасія Василівна',
    course: 4,
  },
  {
    title: 'Жанри віртуальної літератури',
    description:
      'Курс досліджує специфіку літературних творів, створених у цифровому середовищі, та їх жанрове різноманіття',
    faculty: 'Факультет культури й мистецтв',
    teacher: 'Зубко Олеся Іванівна',
    course: 4,
  },
  {
    title: 'Основи продюсерської діяльності в мистецтві',
    description:
      'Курс охоплює основи організації мистецьких проектів, від ідеї до реалізації, із врахуванням продюсерських методик',
    faculty: 'Факультет культури й мистецтв',
    teacher: 'Ященко Роман Олегович',
    course: 4,
  },
  {
    title: 'Дозвіллєво-туристична діяльність',
    description:
      'Курс розкриває основи організації дозвілля та туристичних програм з урахуванням екологічних та культурних аспектів',
    faculty: 'Факультет біології, географії та екології',
    teacher: 'Зінченко Поліна Миколаївна',
    course: 4,
  },
  {
    title: 'Основи графічного дизайну',
    description:
      'Курс знайомить студентів із базовими принципами створення графічних матеріалів та їх застосування в цифрових проєктах',
    faculty: "Факультет комп'ютерних наук, фізики та математики",
    teacher: 'Пономаренко Дмитро Олегович',
    course: 4,
  },
];
